/*
Navicat MySQL Data Transfer

Source Server         : mmf
Source Server Version : 50617
Source Host           : 192.168.0.201:3306
Source Database       : bbb

Target Server Type    : MYSQL
Target Server Version : 50617
File Encoding         : 65001

Date: 2015-07-30 14:20:01
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `Name` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '用户名',
  `Password` varchar(255) COLLATE utf8_bin NOT NULL COMMENT '管理员密码',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'admin', '21232f297a57a5a743894a0e4a801fc3');

-- ----------------------------
-- Table structure for stock
-- ----------------------------
DROP TABLE IF EXISTS `stock`;
CREATE TABLE `stock` (
  `Id` int(10) unsigned NOT NULL AUTO_INCREMENT COMMENT '仓库名',
  `HouseId` int(11) NOT NULL,
  `Name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '产品名称',
  `Type` varchar(40) COLLATE utf8_bin DEFAULT NULL COMMENT '类别',
  `Code` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '产品编号',
  `BuyingDate` date NOT NULL COMMENT '采购日期',
  `PactCode` varchar(50) COLLATE utf8_bin DEFAULT NULL COMMENT '合同编号',
  `Supplier` varchar(50) COLLATE utf8_bin DEFAULT NULL COMMENT '供应商（名）',
  `Specification` varchar(10) COLLATE utf8_bin DEFAULT NULL COMMENT '规格',
  `Area` varchar(30) COLLATE utf8_bin DEFAULT NULL COMMENT '产地',
  `Texture` varchar(40) COLLATE utf8_bin DEFAULT NULL COMMENT '材质',
  `Weight` decimal(8,3) unsigned DEFAULT '0.000' COMMENT '品重量（吨）',
  `Price` decimal(11,2) DEFAULT '0.00' COMMENT '单价',
  `LoanRight` varchar(50) COLLATE utf8_bin DEFAULT NULL COMMENT '贷权',
  `isPay` int(1) NOT NULL DEFAULT '0' COMMENT '是否付款',
  `PayMoney` decimal(11,2) DEFAULT '0.00' COMMENT '付款金额',
  `Note` varchar(10000) COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `AddTime` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=119 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- ----------------------------
-- Records of stock
-- ----------------------------
INSERT INTO `stock` VALUES ('11', '10', '啊实打实', '额外日', '123123', '2015-07-17', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('12', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('14', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('15', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('16', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('17', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('18', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('19', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('20', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('21', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('22', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('23', '96', '啊实打实', '额外日', '123123', '2015-06-25', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '0', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('24', '96', '啊实打实', '额外日', '123123', '2015-06-18', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '0', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('25', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('27', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('28', '96', '啊实打实', '额外日', '123123', '2015-07-05', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '0', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('29', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('30', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('31', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('32', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('33', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('34', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('35', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('36', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('37', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('38', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('39', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('40', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('41', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('42', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('43', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('44', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('45', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('46', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('47', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('48', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('49', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('50', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('51', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('52', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('53', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('54', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('55', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('56', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('57', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('58', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('59', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('60', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('61', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('62', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('63', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('64', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('65', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('66', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('67', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('68', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('69', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('70', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('71', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('72', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('73', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('74', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('75', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('76', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('77', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('78', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('79', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('80', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('81', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('82', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('83', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('84', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('85', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('86', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('87', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('88', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('89', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('90', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('91', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('92', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('93', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('94', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('95', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('96', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('97', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('98', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('99', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('100', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('101', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('102', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('103', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('104', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('105', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('106', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('107', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('108', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('109', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('110', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('111', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('112', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');
INSERT INTO `stock` VALUES ('113', '96', '啊实打实', '额外日', '123123', '0000-00-00', '15343234', '电饭锅', '个', '东方', '管道', '123.000', '1000.00', '312', '1', '4324.00', '司法所', '2015-07-28 10:47:20');

-- ----------------------------
-- Table structure for warehouse
-- ----------------------------
DROP TABLE IF EXISTS `warehouse`;
CREATE TABLE `warehouse` (
  `Id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `Code` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '仓库编号',
  `Name` varchar(50) COLLATE utf8_bin NOT NULL COMMENT '仓库名称',
  `Addr` varchar(80) COLLATE utf8_bin DEFAULT NULL COMMENT '地址',
  `Contact` varchar(30) COLLATE utf8_bin DEFAULT NULL COMMENT '联系人',
  `Tel` varchar(15) COLLATE utf8_bin DEFAULT NULL COMMENT '联系电话',
  `Fax` varchar(15) COLLATE utf8_bin DEFAULT NULL COMMENT '传真',
  `Area` varchar(30) COLLATE utf8_bin DEFAULT NULL COMMENT '产地',
  `Note` varchar(10000) COLLATE utf8_bin DEFAULT NULL COMMENT '备注',
  `AddTime` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '添加时间',
  PRIMARY KEY (`Id`)
) ENGINE=MyISAM AUTO_INCREMENT=127 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- ----------------------------
-- Records of warehouse
-- ----------------------------
INSERT INTO `warehouse` VALUES ('10', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('11', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('12', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('13', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('16', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('17', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('18', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('19', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('20', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('21', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('22', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('23', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('24', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('25', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('26', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('27', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('28', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('29', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('30', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('31', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('32', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('33', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('34', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('35', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('36', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('37', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('38', '123123', '啊实打实', '范德萨范德萨', '收电费收费', '123123', '12312', '4三大队', '大神大神爱上个梵蒂冈', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('39', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('40', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('41', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('42', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('43', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('44', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('45', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('46', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('47', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('48', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('49', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('50', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('51', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('52', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('53', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('54', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('55', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('56', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('57', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('58', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('59', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('60', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('61', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('62', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('63', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('64', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('65', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('66', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('67', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('68', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('69', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('70', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('71', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('72', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('73', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('74', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('75', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('76', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('77', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('78', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('79', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('80', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('81', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('82', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('83', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('84', '123123', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
INSERT INTO `warehouse` VALUES ('85', 'sss1s23123ssss', '阿斯达', '阿斯达', '阿斯达', '123123', '12312377777', '34234777', '规范规定发给', '2015-07-28 10:06:13');
